app/controllers/people_controller.rb

  def new
    @person = Person.new
    @illnesses = Illness.all
---
SELECT "illnesses".* FROM "illnesses"

  def edit
    @person = Person.find(params[:id])
    @illnesses = Illness.all
---
SELECT "illnesses".* FROM "illnesses"